Revit 2027 API
FabricationConfiguration.GetServiceByGUID Method
 Gets the service identifier by its GUID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetServiceByGUID(
	Guid serviceGUID
)
Public Function GetServiceByGUID (
	serviceGUID As Guid
) As Integer
public:
int GetServiceByGUID(
	Guid serviceGUID
)
member GetServiceByGUID :
        serviceGUID : Guid -> int
Parameters
serviceGUID Guid
 The service GUID.
Return Value
Int32
 The service identifier. Returns 0 if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace